app/controllers/subscriptions_controller.rb

    def update_company
        redirect_to subscriptions_path, notice: company.save ? "Plan updated!" : "Plan was not updated!!"
---
INSERT INTO "companies" ("subscription_plan", "created_at", "updated_at") VALUES (?, ?, ?)  [["subscription_plan", "enterpise"], ["created_at", "2022-08-07 11:31:02.223400"], ["updated_at", "2022-08-07 11:31:02.223400"]]

    def set_company
        @company = Company.find_or_create_by(subscription_plan: subscription_params)
---
INSERT INTO "companies" ("subscription_plan", "created_at", "updated_at") VALUES (?, ?, ?)  [["subscription_plan", "enterpise"], ["created_at", "2022-08-07 11:31:02.223400"], ["updated_at", "2022-08-07 11:31:02.223400"]]
SELECT  "companies".* FROM "companies" WHERE "companies"."subscription_plan" = ? LIMIT ?  [["subscription_plan", "enterpise"], ["LIMIT", 1]]